{
  "format": "layers-model",
  "generatedBy": "keras v2.8.0",
  "convertedBy": "TensorFlow.js Converter v3.14.0",
  "modelTopology": {
    "keras_version": "2.8.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Model",
      "config": {
        "name": "model_5",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, null, null, 3],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "Image_Input"
            },
            "name": "Image_Input",
            "inbound_nodes": []
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "CONV_3_1_32_Module_1_1",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "CONV_3_1_32_Module_1_1",
            "inbound_nodes": [[["Image_Input", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "CONV_3_2_64_Module_1_2",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [2, 2],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "CONV_3_2_64_Module_1_2",
            "inbound_nodes": [[["CONV_3_1_32_Module_1_1", 0, 0, {}]]]
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "MPOLL_2_2_Module_1_3",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2],
              "data_format": "channels_last"
            },
            "name": "MPOLL_2_2_Module_1_3",
            "inbound_nodes": [[["CONV_3_2_64_Module_1_2", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "CONV_5_1_32_Module_2_1",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [5, 5],
              "strides": [1, 1],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "CONV_5_1_32_Module_2_1",
            "inbound_nodes": [[["MPOLL_2_2_Module_1_3", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "CONV_5_2_64_Module_2_2",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [5, 5],
              "strides": [2, 2],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "CONV_5_2_64_Module_2_2",
            "inbound_nodes": [[["CONV_5_1_32_Module_2_1", 0, 0, {}]]]
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "MPOLL_2_2_Module_2_3",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2],
              "data_format": "channels_last"
            },
            "name": "MPOLL_2_2_Module_2_3",
            "inbound_nodes": [[["CONV_5_2_64_Module_2_2", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_94",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_94",
            "inbound_nodes": [[["MPOLL_2_2_Module_2_3", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "CONV_3_1_32_Module_3_1",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "CONV_3_1_32_Module_3_1",
            "inbound_nodes": [[["batch_normalization_94", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "CONV_3_2_64_Module_3_2",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [2, 2],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "CONV_3_2_64_Module_3_2",
            "inbound_nodes": [[["CONV_3_1_32_Module_3_1", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "CONV_5_1_32_Module_4_1",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [5, 5],
              "strides": [1, 1],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "CONV_5_1_32_Module_4_1",
            "inbound_nodes": [[["batch_normalization_94", 0, 0, {}]]]
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "MPOLL_2_1_Module_3_3",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [1, 1],
              "data_format": "channels_last"
            },
            "name": "MPOLL_2_1_Module_3_3",
            "inbound_nodes": [[["CONV_3_2_64_Module_3_2", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "CONV_5_2_64_Module_4_2",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [5, 5],
              "strides": [2, 2],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "CONV_5_2_64_Module_4_2",
            "inbound_nodes": [[["CONV_5_1_32_Module_4_1", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_94",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv2d_94",
            "inbound_nodes": [[["MPOLL_2_1_Module_3_3", 0, 0, {}]]]
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "MPOLL_2_1_Module_4_3",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [1, 1],
              "data_format": "channels_last"
            },
            "name": "MPOLL_2_1_Module_4_3",
            "inbound_nodes": [[["CONV_5_2_64_Module_4_2", 0, 0, {}]]]
          },
          {
            "class_name": "Concatenate",
            "config": {
              "name": "concatenate_2",
              "trainable": true,
              "dtype": "float32",
              "axis": -1
            },
            "name": "concatenate_2",
            "inbound_nodes": [
              [
                ["conv2d_94", 0, 0, {}],
                ["MPOLL_2_1_Module_4_3", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "AveragePooling2D",
            "config": {
              "name": "average_pooling2d_9",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [1, 1],
              "data_format": "channels_last"
            },
            "name": "average_pooling2d_9",
            "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "CONV_3_1_128",
              "trainable": true,
              "dtype": "float32",
              "filters": 128,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "CONV_3_1_128",
            "inbound_nodes": [[["average_pooling2d_9", 0, 0, {}]]]
          },
          {
            "class_name": "GlobalAveragePooling2D",
            "config": {
              "name": "global_average_pooling2d_1",
              "trainable": true,
              "dtype": "float32",
              "data_format": "channels_last",
              "keepdims": false
            },
            "name": "global_average_pooling2d_1",
            "inbound_nodes": [[["CONV_3_1_128", 0, 0, {}]]]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_3",
              "trainable": true,
              "dtype": "float32",
              "units": 1000,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense_3",
            "inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_95",
              "trainable": true,
              "dtype": "float32",
              "axis": [1],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_95",
            "inbound_nodes": [[["dense_3", 0, 0, {}]]]
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.5,
              "noise_shape": null,
              "seed": null
            },
            "name": "dropout",
            "inbound_nodes": [[["batch_normalization_95", 0, 0, {}]]]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_4",
              "trainable": true,
              "dtype": "float32",
              "units": 128,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense_4",
            "inbound_nodes": [[["dropout", 0, 0, {}]]]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_5",
              "trainable": true,
              "dtype": "float32",
              "units": 6,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense_5",
            "inbound_nodes": [[["dense_4", 0, 0, {}]]]
          }
        ],
        "input_layers": [["Image_Input", 0, 0]],
        "output_layers": [["dense_5", 0, 0]]
      }
    },
    "training_config": {
      "loss": {
        "class_name": "SparseCategoricalCrossentropy",
        "config": {
          "reduction": "auto",
          "name": "sparse_categorical_crossentropy",
          "from_logits": false
        }
      },
      "metrics": [
        [
          {
            "class_name": "MeanMetricWrapper",
            "config": {
              "name": "acc",
              "dtype": "float32",
              "fn": "sparse_categorical_accuracy"
            }
          }
        ]
      ],
      "weighted_metrics": null,
      "loss_weights": null,
      "optimizer_config": {
        "class_name": "SGD",
        "config": {
          "name": "SGD",
          "learning_rate": 0.01,
          "decay": 0.0,
          "momentum": 0.0,
          "nesterov": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        {
          "name": "CONV_3_1_128/kernel",
          "shape": [3, 3, 128, 128],
          "dtype": "float32"
        },
        { "name": "CONV_3_1_128/bias", "shape": [128], "dtype": "float32" },
        {
          "name": "CONV_3_1_32_Module_1_1/kernel",
          "shape": [3, 3, 3, 32],
          "dtype": "float32"
        },
        {
          "name": "CONV_3_1_32_Module_1_1/bias",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "CONV_3_1_32_Module_3_1/kernel",
          "shape": [3, 3, 64, 32],
          "dtype": "float32"
        },
        {
          "name": "CONV_3_1_32_Module_3_1/bias",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "CONV_3_2_64_Module_1_2/kernel",
          "shape": [3, 3, 32, 64],
          "dtype": "float32"
        },
        {
          "name": "CONV_3_2_64_Module_1_2/bias",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "CONV_3_2_64_Module_3_2/kernel",
          "shape": [3, 3, 32, 64],
          "dtype": "float32"
        },
        {
          "name": "CONV_3_2_64_Module_3_2/bias",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "CONV_5_1_32_Module_2_1/kernel",
          "shape": [5, 5, 64, 32],
          "dtype": "float32"
        },
        {
          "name": "CONV_5_1_32_Module_2_1/bias",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "CONV_5_1_32_Module_4_1/kernel",
          "shape": [5, 5, 64, 32],
          "dtype": "float32"
        },
        {
          "name": "CONV_5_1_32_Module_4_1/bias",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "CONV_5_2_64_Module_2_2/kernel",
          "shape": [5, 5, 32, 64],
          "dtype": "float32"
        },
        {
          "name": "CONV_5_2_64_Module_2_2/bias",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "CONV_5_2_64_Module_4_2/kernel",
          "shape": [5, 5, 32, 64],
          "dtype": "float32"
        },
        {
          "name": "CONV_5_2_64_Module_4_2/bias",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_94/gamma",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_94/beta",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_94/moving_mean",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_94/moving_variance",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_95/gamma",
          "shape": [1000],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_95/beta",
          "shape": [1000],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_95/moving_mean",
          "shape": [1000],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_95/moving_variance",
          "shape": [1000],
          "dtype": "float32"
        },
        {
          "name": "conv2d_94/kernel",
          "shape": [3, 3, 64, 64],
          "dtype": "float32"
        },
        { "name": "conv2d_94/bias", "shape": [64], "dtype": "float32" },
        { "name": "dense_3/kernel", "shape": [128, 1000], "dtype": "float32" },
        { "name": "dense_3/bias", "shape": [1000], "dtype": "float32" },
        { "name": "dense_4/kernel", "shape": [1000, 128], "dtype": "float32" },
        { "name": "dense_4/bias", "shape": [128], "dtype": "float32" },
        { "name": "dense_5/kernel", "shape": [128, 6], "dtype": "float32" },
        { "name": "dense_5/bias", "shape": [6], "dtype": "float32" }
      ]
    }
  ]
}
